vehicle-adapter/doc/vehicle-adapter.org
#+author: Albin Severinson
#+title: Vehicle Adapter Manual

* Introduction
This document breifly explains how to work with the Vehicle Adapter.

* Local Message Set
The vehicle control system communicates with the Vehicle Adapter using
UDP messages encoded according to the specification below. This
specification is called the Local Message Set (LMS) and is written to
be as simple as possible.

The Vehicle Adapter will listen for these messages and, whenever one is
received, use the data contained in it to create and send one
CAM/DENM/iCLCM depending on the local message received. When a
wireless message is received from another vehicle, the Vehicle Adapter
will instead create a local message and send it to the vehicle control
system. The system is symmetric. The Vehicle Adapter is stateless and
does not keep track of the vehicle dynamics itself. It relies solely
on the incoming messages.

Every message type (CAM/DENM/iCLCM) has a corresponding local message
that is used for creating that specific message. These messages are
called "local CAM", "local DENM" and "local iCLCM".

The messages have optional data elements and bit masks are used to
indicate which elements are present. Note that the messages are the
same size even without the optional data elements included, but the
value of those elements are undefined if they are indicated as not
present.

All data is in network byte order, which is identical to big endian.
When working in Matlab/Simulink, keep in mind that those use small
endian and that the byte order of data elements have to be switched
before sending to the Vehicle Adapter if that is the case.

D3.2 is in reference to deliverable 3.2 for the GCDC 2016 competition.
You can find it on the
[[http://gcdc.net/en/teams/rules-and-technology][GCDC website]].

** CAM
| Container:                    | Bytes: | Data:                      | Notes:            |
|-------------------------------+--------+----------------------------+-------------------|
| Header                        |      1 | Message ID                 | $=2$ for CAM      |
|                               |      4 | Station ID                 | Unique station ID |
|                               |      4 | GenerationDeltaTime        | See D3.2          |
|-------------------------------+--------+----------------------------+-------------------|
| Container Mask                |      1 | ContainerMask              | See D3.2          |
|-------------------------------+--------+----------------------------+-------------------|
| Basic Container               |      4 | StationType                | See D3.2          |
|                               |      4 | Latitude                   | See D3.2          |
|                               |      4 | Longitude                  | See D3.2          |
|                               |      4 | SemiMajorConfidence        | See D3.2          |
|                               |      4 | SemiMinorConfidence        | See D3.2          |
|                               |      4 | SemiMajorOrientation       | See D3.2          |
|                               |      4 | Altitude                   | See D3.2          |
|-------------------------------+--------+----------------------------+-------------------|
| High Frequency Container      |      4 | Heading                    | See D3.2          |
|                               |      4 | HeadingConfidence          | See D3.2          |
|                               |      4 | Speed                      | See D3.2          |
|                               |      4 | SpeedConfidence            | See D3.2          |
|                               |      4 | VehicleLength              | See D3.2          |
|                               |      4 | VehicleWidth               | See D3.2          |
|                               |      4 | LongAcceleration           | See D3.2          |
|                               |      4 | LongAccelerationConfidence | See D3.2          |
|                               |      4 | YawRate                    | See D3.2          |
|                               |      4 | YawRateConfidence          | See D3.2          |
|-------------------------------+--------+----------------------------+-------------------|
| (opt) Low Frequency Container |      4 | VehicleRole                | See D3.2          |
|                               |        |                            |                   |


