vehicle-adapter/doc/vehicle-adapter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-26 Sat 17:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Vehicle Adapter Manual</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Albin Severinson" />
</head>
<body>
<div id="content">
<h1 class="title">Vehicle Adapter Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline6">2. Local Message Set</a>
<ul>
<li><a href="#orgheadline2">2.1. CAM</a></li>
<li><a href="#orgheadline3">2.2. DENM</a></li>
<li><a href="#orgheadline4">2.3. iCLCM</a></li>
<li><a href="#orgheadline5">2.4. Development Message Set</a></li>
</ul>
</li>
<li><a href="#orgheadline7">3. License and Copyright</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document breifly explains how to work with the Vehicle Adapter.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Local Message Set</h2>
<div class="outline-text-2" id="text-2">
<p>
The vehicle control system communicates with the Vehicle Adapter using
UDP messages encoded according to the specification below. This
specification is called the Local Message Set (LMS) and is written to
be as simple as possible.
</p>

<p>
The Vehicle Adapter will listen for these messages and, whenever one is
received, use the data contained in it to create and send one
CAM/DENM/iCLCM depending on the local message received. When a
wireless message is received from another vehicle, the Vehicle Adapter
will instead create a local message and send it to the vehicle control
system. The system is symmetric. The Vehicle Adapter is stateless and
does not keep track of the vehicle dynamics itself. It relies solely
on the incoming messages.
</p>

<p>
Every message type (CAM/DENM/iCLCM) has a corresponding local message
that is used for creating that specific message. These messages are
called "local CAM", "local DENM" and "local iCLCM".
</p>

<p>
The messages have optional data elements and bit masks are used to
indicate which elements are present. Note that the messages are the
same size even without the optional data elements included, but the
value of those elements are undefined if they are indicated as not
present.
</p>

<p>
All data is in network byte order, which is identical to big endian.
When working in Matlab/Simulink, keep in mind that those use small
endian and that the byte order of data elements have to be switched
before sending to the Vehicle Adapter if that is the case.
</p>

<p>
D3.2 is in reference to deliverable 3.2 for the GCDC 2016 competition.
You can find it on the
<a href="http://gcdc.net/en/teams/rules-and-technology">GCDC website</a>.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> CAM</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container:</th>
<th scope="col" class="org-right">Bytes:</th>
<th scope="col" class="org-left">Data:</th>
<th scope="col" class="org-left">Notes:</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Header</td>
<td class="org-right">1</td>
<td class="org-left">Message ID</td>
<td class="org-left">\(=2\) for CAM</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Station ID</td>
<td class="org-left">Unique station ID</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">GenerationDeltaTime</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Container Mask</td>
<td class="org-right">1</td>
<td class="org-left">ContainerMask</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Basic Container</td>
<td class="org-right">4</td>
<td class="org-left">StationType</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Latitude</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Longitude</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMajorConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMinorConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMajorOrientation</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Altitude</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">High Frequency Container</td>
<td class="org-right">4</td>
<td class="org-left">Heading</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">HeadingConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Speed</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SpeedConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">VehicleLength</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">VehicleWidth</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">LongAcceleration</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">LongAccelerationConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">YawRate</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">YawRateConfidence</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(opt) Low Frequency Container</td>
<td class="org-right">4</td>
<td class="org-left">VehicleRole</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
