vehicle-adapter/doc/vehicle-adapter.org
** DENM
| Container:               | Bytes: | Data:                            | Notes:                             |
|--------------------------+--------+----------------------------------+------------------------------------|
| Header                   |      1 | MessageID                        | $=1$ for DENM                      |
|                          |      4 | StationID                        | Unique station ID                  |
|                          |      4 | GenerationDeltaTime              | See D3.2                           |
|--------------------------+--------+----------------------------------+------------------------------------|
| Container Mask           |      1 | ContainerMask                    |                                    |
|--------------------------+--------+----------------------------------+------------------------------------|
| Management Container     |      1 | ManagementMask                   |                                    |
|                          |      4 | DetectionTime                    | Increments of 65 536 ms since 2004 |
|                          |      4 | ReferenceTime                    | Increments of 65 536 ms since 2004 |
|                          |      4 | (opt) Termination                | See D3.2                           |
|                          |      4 | Latitude                         | See D3.2                           |
|                          |      4 | Longitude                        | See D3.2                           |
|                          |      4 | SemiMajorConfidence              | See D3.2                           |
|                          |      4 | SemiMinorConfidence              | See D3.2                           |
|                          |      4 | SemiMajorOrientation             | See D3.2                           |
|                          |      4 | Altitude                         | See D3.2                           |
|                          |      4 | (opt) RelevanceDistance          | See D3.2                           |
|                          |      4 | (opt) RelevanceTrafficDirection  | See D3.2                           |
|                          |      4 | (opt) ValidityDuration           | See D3.2                           |
|                          |      4 | (opt) TransmissionIntervall      | See D3.2                           |
|                          |      4 | StationType                      | See D3.2                           |
|--------------------------+--------+----------------------------------+------------------------------------|
| (opt)Situation Container |      1 | SituationMask                    |                                    |
|                          |      4 | InformationQuality               | See D3.2                           |
|                          |      4 | CauseCode                        | See D3.2                           |
|                          |      4 | SubCauseCode                     | See D3.2                           |
|                          |      4 | (opt) LinkedCauseCode            | See D3.2                           |
|                          |      4 | (opt) LinkedSubCauseCode         | See D3.2                           |
|                          |      0 | (opt) EventHistory               | Not implemented                    |
|--------------------------+--------+----------------------------------+------------------------------------|
| (opt) Location Container |      0 | LocationMask                     | Not implemented                    |
|                          |      0 | (opt) EventSpeed                 | Not implemented                    |
|                          |      0 | (opt) EventPositionheading       | Not implemented                    |
|                          |      0 | Traces                           | Not implemented                    |
|                          |      0 | (opt) RoadType                   | Not implemented                    |
|--------------------------+--------+----------------------------------+------------------------------------|
| (opt) Alacarte Container |      1 | AlacarteMask                     |                                    |
|                          |      4 | (opt) LanePosition               | See D3.2                           |
|                          |      0 | (opt) ImpactReducationContainer  | Not implemented                    |
|                          |      4 | (opt) ExternalTemperature        | See D3.2                           |
|                          |      0 | (opt) RoadWorksContainerExtended | Not implemented                    |
|                          |      4 | (opt) PositioningSolution        | See D3.2                           |
|                          |      0 | (opt) StationaryVehicleContainer | Not implemented                    |
|                          |        |                                  |                                    |

