vehicle-adapter/doc/vehicle-adapter.html


<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> DENM</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container:</th>
<th scope="col" class="org-right">Bytes:</th>
<th scope="col" class="org-left">Data:</th>
<th scope="col" class="org-left">Notes:</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Header</td>
<td class="org-right">1</td>
<td class="org-left">MessageID</td>
<td class="org-left">\(=1\) for DENM</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">StationID</td>
<td class="org-left">Unique station ID</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">GenerationDeltaTime</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Container Mask</td>
<td class="org-right">1</td>
<td class="org-left">ContainerMask</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Management Container</td>
<td class="org-right">1</td>
<td class="org-left">ManagementMask</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">DetectionTime</td>
<td class="org-left">Increments of 65 536 ms since 2004</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">ReferenceTime</td>
<td class="org-left">Increments of 65 536 ms since 2004</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) Termination</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Latitude</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Longitude</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMajorConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMinorConfidence</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SemiMajorOrientation</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Altitude</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) RelevanceDistance</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) RelevanceTrafficDirection</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) ValidityDuration</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) TransmissionIntervall</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">StationType</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(opt)Situation Container</td>
<td class="org-right">1</td>
<td class="org-left">SituationMask</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">InformationQuality</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">CauseCode</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">SubCauseCode</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) LinkedCauseCode</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) LinkedSubCauseCode</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) EventHistory</td>
<td class="org-left">Not implemented</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(opt) Location Container</td>
<td class="org-right">0</td>
<td class="org-left">LocationMask</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) EventSpeed</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) EventPositionheading</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">Traces</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) RoadType</td>
<td class="org-left">Not implemented</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(opt) Alacarte Container</td>
<td class="org-right">1</td>
<td class="org-left">AlacarteMask</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) LanePosition</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) ImpactReducationContainer</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) ExternalTemperature</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) RoadWorksContainerExtended</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) PositioningSolution</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">(opt) StationaryVehicleContainer</td>
<td class="org-left">Not implemented</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
