vehicle-adapter/doc/vehicle-adapter.org
** iCLCM
| Container:                    | Bytes: | Data:                            | Notes:            |
|-------------------------------+--------+----------------------------------+-------------------|
| Header                        |      1 | MessageID                        | $=10$ for iCLCM   |
|                               |      4 | StationID                        | Unique station ID |
|-------------------------------+--------+----------------------------------+-------------------|
| Container Mask                |      1 | Container mask                   |                   |
|-------------------------------+--------+----------------------------------+-------------------|
| High frequency container      |      4 | Rear axle location               | See D3.2          |
|                               |      4 | Controller type                  | See D3.2          |
|                               |      4 | Response time constant           | See D3.2          |
|                               |      4 | Response time delay              | See D3.2          |
|                               |      4 | Target longitudinal acceleration | See D3.2          |
|                               |      4 | Time headway                     | See D3.2          |
|                               |      4 | Cruise speed                     | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| (opt) Low frequency container |      1 | Low frequency mask               |                   |
|                               |      4 | (opt) Participants ready         | See D3.2          |
|                               |      4 | (opt) Start platoon              | See D3.2          |
|                               |      4 | (opt) End-of-scenario            | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| MIO                           |      4 | Mio ID                           | See D3.2          |
|                               |      4 | Mio Range                        | See D3.2          |
|                               |      4 | Mio Bearing                      | See D3.2          |
|                               |      4 | Mio Range rate                   | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| Lane                          |      4 | Lane                             | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| Pair ID                       |      4 | Forward ID                       | See D3.2          |
|                               |      4 | Backward ID                      | See D3.2          |
|                               |      4 | Acknowledgement flag             | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| Merge                         |      4 | Merge request                    | See D3.2          |
|                               |      4 | Safe-to-merge                    | See D3.2          |
|                               |      4 | Flag                             | See D3.2          |
|                               |      4 | Flag tail                        | See D3.2          |
|                               |      4 | Flag head                        | See D3.2          |
|-------------------------------+--------+----------------------------------+-------------------|
| Intersection                  |      4 | Platoon ID                       | See D3.2          |
|                               |      4 | Distance travelled in CZ         | See D3.2          |
|                               |      4 | Intention                        | See D3.2          |
|                               |      4 | Counter                          | See D3.2          |
|                               |        |                                  |                   |

** Development Message Set
We've had requests for creating a message set that allows sending
arbitrary data between stations for cases when you need to send
specific data not covered by the CAM/DENM/iCLCM but don't want to
develop an entirely new message set. This would potentially be very
useful for development, but it's not something we're currently working
on. If this is something you need, send an email to
albin@severinson.org or start a discussion on Github.


* License and Copyright
The Vehicle Adapter is written by Albin Severinson and is licensed
under the business friendly Apache-2.0 license. 
