vehicle-adapter/doc/vehicle-adapter.html

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> iCLCM</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container:</th>
<th scope="col" class="org-right">Bytes:</th>
<th scope="col" class="org-left">Data:</th>
<th scope="col" class="org-left">Notes:</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Header</td>
<td class="org-right">1</td>
<td class="org-left">MessageID</td>
<td class="org-left">\(=10\) for iCLCM</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">StationID</td>
<td class="org-left">Unique station ID</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Container Mask</td>
<td class="org-right">1</td>
<td class="org-left">Container mask</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">High frequency container</td>
<td class="org-right">4</td>
<td class="org-left">Rear axle location</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Controller type</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Response time constant</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Response time delay</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Target longitudinal acceleration</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Time headway</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Cruise speed</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">(opt) Low frequency container</td>
<td class="org-right">1</td>
<td class="org-left">Low frequency mask</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) Participants ready</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) Start platoon</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">(opt) End-of-scenario</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MIO</td>
<td class="org-right">4</td>
<td class="org-left">Mio ID</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Mio Range</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Mio Bearing</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Mio Range rate</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Lane</td>
<td class="org-right">4</td>
<td class="org-left">Lane</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Pair ID</td>
<td class="org-right">4</td>
<td class="org-left">Forward ID</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Backward ID</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Acknowledgement flag</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Merge</td>
<td class="org-right">4</td>
<td class="org-left">Merge request</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Safe-to-merge</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Flag</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Flag tail</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Flag head</td>
<td class="org-left">See D3.2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Intersection</td>
<td class="org-right">4</td>
<td class="org-left">Platoon ID</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Distance travelled in CZ</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Intention</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-left">Counter</td>
<td class="org-left">See D3.2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.4</span> Development Message Set</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We've had requests for creating a message set that allows sending
arbitrary data between stations for cases when you need to send
specific data not covered by the CAM/DENM/iCLCM but don't want to
develop an entirely new message set. This would potentially be very
useful for development, but it's not something we're currently working
on. If this is something you need, send an email to
albin@severinson.org or start a discussion on Github.
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> License and Copyright</h2>
<div class="outline-text-2" id="text-3">
<p>
The Vehicle Adapter is written by Albin Severinson and is licensed
under the business friendly Apache-2.0 license. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Albin Severinson</p>
<p class="date">Created: 2016-03-26 Sat 17:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
